# Taps
#
tap "homebrew/bundle"
tap "homebrew/core"

# Brew formulae
#
brew "antigen"
brew "bat"
brew "bat"
brew "bfs"
brew "broot"
brew "curl"
brew "diffutils"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "htop"
brew "jq"
brew "mas"
brew "media-info"
brew "psgrep"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "telnet"
brew "timedog"
brew "tree"
brew "trippy"
brew "unar"
brew "zsh"

# Casks
#
cask "1password"
cask "alfred"
cask "appcleaner"
cask "arq"
#cask "bettertouchtool"
#cask "betterzip"
cask "daisydisk"
#cask "displaycal"
cask "dropbox"
cask "fantastical"
#cask "fastrawviewer"
cask "font-anonymice-powerline"
cask "font-consolas-for-powerline"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-g-for-powerline"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-noto-mono-for-powerline"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "heynote"
cask "iina"
cask "karabiner-elements"
cask "numi"
cask "nvalt"
cask "private-internet-access"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
#cask "photosync"
cask "private-internet-access"
cask "signal"
cask "timemachineeditor"
#cask "transmit"
#cask "viscosity"
cask "vlc"
#cask "xee"
#cask "zoom"

# Apple Store apps
#
mas "AdGuard for Safari", id: 1440147259
mas "Bear", id: 1091189122
mas "Disk Speed Test", id: 425264550
mas "Microsoft Remote Desktop", id: 1295203466
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
#mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pins", id: 1547106997
mas "Slack", id: 803453959
#mas "The Unarchiver", id: 425424353
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
#mas "Unsplash Wallpapers", id: 1284863847
#mas "Vimari", id: 1480933944
